Table of Contents
 Class PointResultOfNLA
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Point Result of NLA
[Obfuscation(Feature = "renaming")]
public class PointResultOfNLA : PointResultBase
Inheritance
object
PointResultBase
PointResultOfNLA
Inherited Members
 PointResultBase.Loading
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 AxialForce
Axial force
public double AxialForce { get; set; }
Property Value
double
 AxialStrain
Axial strain
public double AxialStrain { get; set; }
Property Value
double
 AxialStress
Axial stress
public double AxialStress { get; set; }
Property Value
double
 Edit this page